Revit 2026 API

# ElementRecord Class

---

A record in the Revit database representing an element.

SystemObject Autodesk.Revit.DBElementRecord

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementRecord : IDisposable
```
```vb
Public Class ElementRecord
	Implements IDisposable
```
```cpp
public ref class ElementRecord : IDisposable
```
```fsharp
type ElementRecord =
    class
        interface IDisposable
    end
```

The ElementRecord type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | WorksetId | Get Id of the workset which owns the element. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ElementRecord |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundingBox | Gets the bounding box of the element record. |
|  | GetCategoryId | Gets the category id of the element record. |
|  | GetDesignOptionId | Gets the design option id of the element record. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetId | Gets the id of the element record. |
|  | GetOwnerViewId | Gets the element id of the owner view record. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasBoundingBox | Determines whether this element record has a bounding box. |
|  | IsAnElementType | Identifies if the element record represents an ElementType. |
|  | IsCurveDriven | Identifies if the element is curve driven. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The record is used to extract basic information about an element before the element is fully expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace